archives/2024/Results/Verifications/S2427/bottleneck-determination/point_select/threads-20/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=20 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 20
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 20 tps: 13587.26 qps: 13587.26 (r/w/o: 13587.26/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 20 tps: 13205.52 qps: 13205.52 (r/w/o: 13205.52/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 20 tps: 13608.68 qps: 13608.68 (r/w/o: 13608.68/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 20 tps: 14012.71 qps: 14012.71 (r/w/o: 14012.71/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 20 tps: 13707.18 qps: 13707.18 (r/w/o: 13707.18/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 20 tps: 13841.78 qps: 13841.78 (r/w/o: 13841.78/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 20 tps: 13733.28 qps: 13733.28 (r/w/o: 13733.28/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 20 tps: 13721.27 qps: 13721.27 (r/w/o: 13721.27/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 20 tps: 13866.63 qps: 13866.63 (r/w/o: 13866.63/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 20 tps: 13676.63 qps: 13676.63 (r/w/o: 13676.63/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1369684
        write:                           0
        other:                           0
        total:                           1369684
    transactions:                        1369684 (13695.72 per sec.)
    queries:                             1369684 (13695.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0056s
    total number of events:              1369684

Latency (ms):
         min:                                    0.68
         avg:                                    1.46
         max:                                   88.40
         95th percentile:                        3.02
         sum:                              1998580.72

Threads fairness:
    events (avg/stddev):           68484.2000/211.24
    execution time (avg/stddev):   99.9290/0.00


real    1m40.095s
user    0m23.221s
sys     0m39.163s